In [6]:
raw = {
    "email":['dss@gmail.com', 'fcam@daum.net', 'kim@naver.com'],
    "name":['dss', 'fcam', 'kim'],
    "id":[1,2,3]
}

In [8]:
df = pd.DataFrame(raw)
df

           email  name  id
0  dss@gmail.com   dss   1
1  fcam@daum.net  fcam   2
2  kim@naver.com   kim   3

In [9]:
def domain(email):
    return email.split('@')[1].split('.')[0]

domain(df.loc[0]['email'])

'gmail'

In [26]:
df['domain'] = df['email'].apply(domain)
df

           email  name  id domain
0  dss@gmail.com   dss   1  gmail
1  fcam@daum.net  fcam   2   daum
2  kim@naver.com   kim   3  naver

In [36]:
df['domain'] = (df['email'].apply(lambda email: email.split('@')[1].split('.')[0]))
df

           email  name  id domain
0  dss@gmail.com   dss   1  gmail
1  fcam@daum.net  fcam   2   daum
2  kim@naver.com   kim   3  naver

In [113]:
from makedata import *

In [39]:
get_name()

'Arnold'

In [40]:
get_age()

39

In [77]:
df1 = pd.DataFrame(make_data(5))

In [78]:
df2 = pd.DataFrame(make_data(5))

In [79]:
df3 = df1.append(df2)

In [80]:
df3

   Age     Name
0   34    Billy
1   31   Andrew
2   24    Alvin
3   33     Alex
4   34  Anthony
0   38     Alex
1   29   Arnold
2   26     Alex
3   33     Adam
4   27   Anchal

In [81]:
df3[2:5]

   Age     Name
2   24    Alvin
3   33     Alex
4   34  Anthony

# index reset

In [50]:
df3.reset_index() # just return

   index  Age     Name
0      0   24   Arnold
1      1   33     Alex
2      2   25     Alex
3      3   32      Jin
4      4   34   Arnold
5      0   34    Alvin
6      1   33  Anthony
7      2   32     Alex
8      3   24     Adam
9      4   35   Andrew

In [82]:
df3.reset_index(drop=True, inplace = True)

In [83]:
df3.tail()

   Age    Name
5   38    Alex
6   29  Arnold
7   26    Alex
8   33    Adam
9   27  Anchal

# ignore_index = True more convience!!

# concat

In [62]:
df3 = pd.concat([df1, df2]).reset_index(drop =True)
df3.tail()

   Age     Name
5   34    Alvin
6   33  Anthony
7   32     Alex
8   24     Adam
9   35   Andrew

In [85]:
pd.concat([df3, df1], axis = 1, join='inner')

   Age     Name  Age     Name
0   34    Billy   34    Billy
1   31   Andrew   31   Andrew
2   24    Alvin   24    Alvin
3   33     Alex   33     Alex
4   34  Anthony   34  Anthony

In [87]:
df = pd.DataFrame(make_data(10))
df

   Age    Name
0   38   Billy
1   23   Billy
2   26    Alan
3   34  Anchal
4   20    Alan
5   32  Arnold
6   27   Alvin
7   24    Alan
8   34    Alan
9   35  Anchal

In [96]:
df_ncount = df.groupby('Name').size().reset_index(name='count')
df_ncount

     Name  count
0    Alan      4
1   Alvin      1
2  Anchal      2
3  Arnold      1
4   Billy      2

In [98]:
df_age_mean = df.groupby('Name').agg('mean')
df_age_mean

         Age
Name
Alan    26.0
Alvin   27.0
Anchal  34.5
Arnold  32.0
Billy   30.5

In [99]:
df_ncount

     Name  count
0    Alan      4
1   Alvin      1
2  Anchal      2
3  Arnold      1
4   Billy      2

In [104]:
df_ncount.sort_values('count', ascending=True)

     Name  count
1   Alvin      1
3  Arnold      1
2  Anchal      2
4   Billy      2
0    Alan      4

In [108]:
# agg
# size(), mean(), max(), min()
df.groupby('Name').agg('mean').reset_index()

     Name   Age
0    Alan  26.0
1   Alvin  27.0
2  Anchal  34.5
3  Arnold  32.0
4   Billy  30.5

In [111]:
df.describe()

             Age
count  10.000000
mean   29.300000
std     6.056218
min    20.000000
25%    24.500000
50%    29.500000
75%    34.000000
max    38.000000

# Merge = SQL join

In [210]:
# 사람의 이름과 나이가 들어간 데이터를 만듭니다.
import random
import numpy as np

# 랜덤한 이름 출력하는 함수
def get_name():
    names = ["Adam", "Alan", "Alex", "Alvin", "Andrew",
             "Anthony", "Arnold", "Jin", "Billy", "Anchal"]
    return random.choice(names)

# 랜덤한 나이 출력
def get_age(start=20, end=40):
    return np.random.randint(start, end + 1)

# 랜덤하게 나이와 이름을 출력
def make_data(rows=10):
    datas = []
    for _ in range(rows):
        data = {"Age": get_age(), "Name": get_name()}
        datas.append(data)
    return datas

In [291]:
# 랜덤한 이름 출력하는 함수
def get_name():
    name_pool = ["Adam Sandler", "Alan moris", "Alex joy", "Alvin topffer", "Andrew kim",
             "Anthony kim", "Arnold shuwaltz", "Jin macoy", "Billy joel", "Anchal choi"]
    return random.choice(name_pool)
# 랜덤한 나이 출력 
def get_age(start=20, end=50):
    return random.randint(start, end)
# 랜덤하게 나이와 이름을 출력
def make_data():
    return get_age() , get_name()

In [292]:
get_name()

'Jin macoy'

In [309]:
make_data()

(23, 'Alvin topffer')

In [328]:
User_ls = {}

names = []
while True:
    name = get_name()
    if name not in names:
        names.append(name)
    if len(names) >= 8:
        break
User_ls['Name'] = names   
User_ls['Age'] = [get_age() for _ in range(8)]
User_ls['User_id'] = [i for i in range(1,9)]

In [329]:
df = pd.DataFrame(User_ls)
df

            Name  Age  User_id
0     Billy joel   25        1
1   Adam Sandler   46        2
2  Alvin topffer   20        3
3     Alan moris   37        4
4    Anthony kim   50        5
5     Andrew kim   25        6
6       Alex joy   45        7
7    Anchal choi   20        8

# DataFrame make by list Dict

In [344]:
# Better than Upper code!
User_ls = pd.DataFrame(columns = ['Age','UserID', 'Name', ])

for idx in range(1,9):
    name = get_name()
    age  = get_age()
    
    data = {'Name':name, 'UserID':idx, 'Age':age}
    
    User_ls.loc[len(User_ls)] = data

User_ls

  Age UserID             Name
0  22      1       Andrew kim
1  48      2    Alvin topffer
2  21      3       Alan moris
3  47      4  Arnold shuwaltz
4  20      5         Alex joy
5  36      6      Anchal choi
6  43      7         Alex joy
7  28      8      Anthony kim

# money df

In [341]:
mon_df = pd.DataFrame(columns = ['ID', 'Amount'])

for idx in range(1,15):
    id = random.randint(1,9)
    money  = random.randint(1,21) * 1000
    data = {'ID':id, 'Amount':money}
    
    mon_df.loc[len(mon_df)] = data

mon_df
mon_df_uniq = mon_df['ID'].unique()
mon_df_uniq.sort()
mon_df_uniq

array([1, 3, 4, 5, 6, 7, 8, 9], dtype=object)

In [346]:
ndf = User_ls.merge(mon_df, left_on = "UserID", right_on = "ID")

In [371]:
ndf.groupby('Name').agg('sum')[['ID','Amount']]

                 ID  Amount
Name
Alan moris        3    8000
Alex joy         22   68000
Anchal choi       6    5000
Andrew kim        1    3000
Anthony kim      16   17000
Arnold shuwaltz   8    2000

In [373]:
result = pd.merge(User_ls, ndf, how='outer')
result

   Age UserID             Name   ID Amount
0   22      1       Andrew kim    1   3000
1   48      2    Alvin topffer  NaN    NaN
2   21      3       Alan moris    3   8000
3   47      4  Arnold shuwaltz    4   1000
4   47      4  Arnold shuwaltz    4   1000
5   20      5         Alex joy    5  21000
6   20      5         Alex joy    5  18000
7   20      5         Alex joy    5  21000
8   36      6      Anchal choi    6   5000
9   43      7         Alex joy    7   8000
10  28      8      Anthony kim    8   5000
11  28      8      Anthony kim    8  12000

In [381]:
result.fillna(value = 10000, inplace = True)

In [382]:
result.dtypes

Age        int64
UserID     int64
Name      object
ID         int64
Amount     int64
dtype: object

In [384]:
result['Amount'] = result['Amount'].astype('int')
result

    Age  UserID             Name     ID  Amount
0    22       1       Andrew kim      1    3000
1    48       2    Alvin topffer  10000   10000
2    21       3       Alan moris      3    8000
3    47       4  Arnold shuwaltz      4    1000
4    47       4  Arnold shuwaltz      4    1000
5    20       5         Alex joy      5   21000
6    20       5         Alex joy      5   18000
7    20       5         Alex joy      5   21000
8    36       6      Anchal choi      6    5000
9    43       7         Alex joy      7    8000
10   28       8      Anthony kim      8    5000
11   28       8      Anthony kim      8   12000

In [398]:
result['Name'].unique()

array(['Andrew kim', 'Alvin topffer', 'Alan moris', 'Arnold shuwaltz',
       'Alex joy', 'Anchal choi', 'Anthony kim'], dtype=object)

In [413]:
sorted_ = result.sort_values(['Amount'], ascending = False)

In [417]:
a = sorted_.groupby('Name')
a

# pandas pivot

In [422]:
# padas io

In [423]:
df = pd.read_csv('train.csv')

In [425]:
df.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [428]:
df.to_csv('save_test_csv.csv', index = False) #encording = euc-kr, utf-8, ASCii